MikroElektronika/core_packages/PIC/XC8/def/PIC16F1768/mcu.h
extern volatile CM3NSELbits_t CM3NSELbits __at(0x11A);
// bitfield macros
#define _CM3NSEL_NCH_POSN                                   0x0
#define _CM3NSEL_NCH_POSITION                               0x0
#define _CM3NSEL_NCH_SIZE                                   0x3
#define _CM3NSEL_NCH_LENGTH                                 0x3
#define _CM3NSEL_NCH_MASK                                   0x7
#define _CM3NSEL_NCH0_POSN                                  0x0
#define _CM3NSEL_NCH0_POSITION                              0x0
#define _CM3NSEL_NCH0_SIZE                                  0x1
#define _CM3NSEL_NCH0_LENGTH                                0x1
#define _CM3NSEL_NCH0_MASK                                  0x1
#define _CM3NSEL_NCH1_POSN                                  0x1
#define _CM3NSEL_NCH1_POSITION                              0x1
#define _CM3NSEL_NCH1_SIZE                                  0x1
#define _CM3NSEL_NCH1_LENGTH                                0x1
#define _CM3NSEL_NCH1_MASK                                  0x2
#define _CM3NSEL_NCH2_POSN                                  0x2
#define _CM3NSEL_NCH2_POSITION                              0x2
#define _CM3NSEL_NCH2_SIZE                                  0x1
#define _CM3NSEL_NCH2_LENGTH                                0x1
#define _CM3NSEL_NCH2_MASK                                  0x4
#define _CM3NSEL_C3NCH_POSN                                 0x0
#define _CM3NSEL_C3NCH_POSITION                             0x0
#define _CM3NSEL_C3NCH_SIZE                                 0x3
#define _CM3NSEL_C3NCH_LENGTH                               0x3
#define _CM3NSEL_C3NCH_MASK                                 0x7
#define _CM3NSEL_C3NCH0_POSN                                0x0
#define _CM3NSEL_C3NCH0_POSITION                            0x0
#define _CM3NSEL_C3NCH0_SIZE                                0x1
#define _CM3NSEL_C3NCH0_LENGTH                              0x1
#define _CM3NSEL_C3NCH0_MASK                                0x1
#define _CM3NSEL_C3NCH1_POSN                                0x1
#define _CM3NSEL_C3NCH1_POSITION                            0x1
#define _CM3NSEL_C3NCH1_SIZE                                0x1
#define _CM3NSEL_C3NCH1_LENGTH                              0x1
#define _CM3NSEL_C3NCH1_MASK                                0x2
#define _CM3NSEL_C3NCH2_POSN                                0x2
#define _CM3NSEL_C3NCH2_POSITION                            0x2
#define _CM3NSEL_C3NCH2_SIZE                                0x1
#define _CM3NSEL_C3NCH2_LENGTH                              0x1
#define _CM3NSEL_C3NCH2_MASK                                0x4

// Register: CM3PSEL
#define CM3PSEL CM3PSEL
extern volatile unsigned char           CM3PSEL             __at(0x11B);
#ifndef _LIB_BUILD
asm("CM3PSEL equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C3PCH                  :4;
    };
    struct {
        unsigned C3PCH0                 :1;
        unsigned C3PCH1                 :1;
        unsigned C3PCH2                 :1;
        unsigned C3PCH3                 :1;
    };
} CM3PSELbits_t;
extern volatile CM3PSELbits_t CM3PSELbits __at(0x11B);
// bitfield macros
#define _CM3PSEL_PCH_POSN                                   0x0
#define _CM3PSEL_PCH_POSITION                               0x0
#define _CM3PSEL_PCH_SIZE                                   0x4
#define _CM3PSEL_PCH_LENGTH                                 0x4
#define _CM3PSEL_PCH_MASK                                   0xF
#define _CM3PSEL_PCH0_POSN                                  0x0
#define _CM3PSEL_PCH0_POSITION                              0x0
#define _CM3PSEL_PCH0_SIZE                                  0x1
#define _CM3PSEL_PCH0_LENGTH                                0x1
#define _CM3PSEL_PCH0_MASK                                  0x1
#define _CM3PSEL_PCH1_POSN                                  0x1
#define _CM3PSEL_PCH1_POSITION                              0x1
#define _CM3PSEL_PCH1_SIZE                                  0x1
#define _CM3PSEL_PCH1_LENGTH                                0x1
#define _CM3PSEL_PCH1_MASK                                  0x2
#define _CM3PSEL_PCH2_POSN                                  0x2
#define _CM3PSEL_PCH2_POSITION                              0x2
#define _CM3PSEL_PCH2_SIZE                                  0x1
#define _CM3PSEL_PCH2_LENGTH                                0x1
#define _CM3PSEL_PCH2_MASK                                  0x4
#define _CM3PSEL_PCH3_POSN                                  0x3
#define _CM3PSEL_PCH3_POSITION                              0x3
#define _CM3PSEL_PCH3_SIZE                                  0x1
#define _CM3PSEL_PCH3_LENGTH                                0x1
#define _CM3PSEL_PCH3_MASK                                  0x8
#define _CM3PSEL_C3PCH_POSN                                 0x0
#define _CM3PSEL_C3PCH_POSITION                             0x0
#define _CM3PSEL_C3PCH_SIZE                                 0x4
#define _CM3PSEL_C3PCH_LENGTH                               0x4
#define _CM3PSEL_C3PCH_MASK                                 0xF
#define _CM3PSEL_C3PCH0_POSN                                0x0
#define _CM3PSEL_C3PCH0_POSITION                            0x0
#define _CM3PSEL_C3PCH0_SIZE                                0x1
#define _CM3PSEL_C3PCH0_LENGTH                              0x1
#define _CM3PSEL_C3PCH0_MASK                                0x1
#define _CM3PSEL_C3PCH1_POSN                                0x1
#define _CM3PSEL_C3PCH1_POSITION                            0x1
#define _CM3PSEL_C3PCH1_SIZE                                0x1
#define _CM3PSEL_C3PCH1_LENGTH                              0x1
#define _CM3PSEL_C3PCH1_MASK                                0x2
#define _CM3PSEL_C3PCH2_POSN                                0x2
#define _CM3PSEL_C3PCH2_POSITION                            0x2
#define _CM3PSEL_C3PCH2_SIZE                                0x1
#define _CM3PSEL_C3PCH2_LENGTH                              0x1
#define _CM3PSEL_C3PCH2_MASK                                0x4
#define _CM3PSEL_C3PCH3_POSN                                0x3
#define _CM3PSEL_C3PCH3_POSITION                            0x3
#define _CM3PSEL_C3PCH3_SIZE                                0x1
#define _CM3PSEL_C3PCH3_LENGTH                              0x1
#define _CM3PSEL_C3PCH3_MASK                                0x8

// Register: CM4CON0
#define CM4CON0 CM4CON0
extern volatile unsigned char           CM4CON0             __at(0x11C);
#ifndef _LIB_BUILD
asm("CM4CON0 equ 011Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C4SYNC                 :1;
        unsigned C4HYS                  :1;
        unsigned C4SP                   :1;
        unsigned C4ZLF                  :1;
        unsigned C4POL                  :1;
        unsigned                        :1;
        unsigned C4OUT                  :1;
        unsigned C4ON                   :1;
    };
} CM4CON0bits_t;
extern volatile CM4CON0bits_t CM4CON0bits __at(0x11C);
// bitfield macros
#define _CM4CON0_SYNC_POSN                                  0x0
#define _CM4CON0_SYNC_POSITION                              0x0
#define _CM4CON0_SYNC_SIZE                                  0x1
#define _CM4CON0_SYNC_LENGTH                                0x1
#define _CM4CON0_SYNC_MASK                                  0x1
#define _CM4CON0_HYS_POSN                                   0x1
#define _CM4CON0_HYS_POSITION                               0x1
#define _CM4CON0_HYS_SIZE                                   0x1
#define _CM4CON0_HYS_LENGTH                                 0x1
#define _CM4CON0_HYS_MASK                                   0x2
#define _CM4CON0_ZLF_POSN                                   0x3
#define _CM4CON0_ZLF_POSITION                               0x3
#define _CM4CON0_ZLF_SIZE                                   0x1
#define _CM4CON0_ZLF_LENGTH                                 0x1
#define _CM4CON0_ZLF_MASK                                   0x8
#define _CM4CON0_POL_POSN                                   0x4
#define _CM4CON0_POL_POSITION                               0x4
#define _CM4CON0_POL_SIZE                                   0x1
#define _CM4CON0_POL_LENGTH                                 0x1
#define _CM4CON0_POL_MASK                                   0x10
#define _CM4CON0_OUT_POSN                                   0x6
#define _CM4CON0_OUT_POSITION                               0x6
#define _CM4CON0_OUT_SIZE                                   0x1
#define _CM4CON0_OUT_LENGTH                                 0x1
#define _CM4CON0_OUT_MASK                                   0x40
#define _CM4CON0_ON_POSN                                    0x7
#define _CM4CON0_ON_POSITION                                0x7
#define _CM4CON0_ON_SIZE                                    0x1
#define _CM4CON0_ON_LENGTH                                  0x1
#define _CM4CON0_ON_MASK                                    0x80
#define _CM4CON0_C4SYNC_POSN                                0x0
#define _CM4CON0_C4SYNC_POSITION                            0x0
#define _CM4CON0_C4SYNC_SIZE                                0x1
#define _CM4CON0_C4SYNC_LENGTH                              0x1
#define _CM4CON0_C4SYNC_MASK                                0x1
#define _CM4CON0_C4HYS_POSN                                 0x1
#define _CM4CON0_C4HYS_POSITION                             0x1
#define _CM4CON0_C4HYS_SIZE                                 0x1
#define _CM4CON0_C4HYS_LENGTH                               0x1
#define _CM4CON0_C4HYS_MASK                                 0x2
#define _CM4CON0_C4SP_POSN                                  0x2
#define _CM4CON0_C4SP_POSITION                              0x2
#define _CM4CON0_C4SP_SIZE                                  0x1
#define _CM4CON0_C4SP_LENGTH                                0x1
#define _CM4CON0_C4SP_MASK                                  0x4
#define _CM4CON0_C4ZLF_POSN                                 0x3
#define _CM4CON0_C4ZLF_POSITION                             0x3
#define _CM4CON0_C4ZLF_SIZE                                 0x1
#define _CM4CON0_C4ZLF_LENGTH                               0x1
#define _CM4CON0_C4ZLF_MASK                                 0x8
#define _CM4CON0_C4POL_POSN                                 0x4
#define _CM4CON0_C4POL_POSITION                             0x4
#define _CM4CON0_C4POL_SIZE                                 0x1
#define _CM4CON0_C4POL_LENGTH                               0x1
#define _CM4CON0_C4POL_MASK                                 0x10
#define _CM4CON0_C4OUT_POSN                                 0x6
#define _CM4CON0_C4OUT_POSITION                             0x6
#define _CM4CON0_C4OUT_SIZE                                 0x1
#define _CM4CON0_C4OUT_LENGTH                               0x1
#define _CM4CON0_C4OUT_MASK                                 0x40
#define _CM4CON0_C4ON_POSN                                  0x7
#define _CM4CON0_C4ON_POSITION                              0x7
#define _CM4CON0_C4ON_SIZE                                  0x1
#define _CM4CON0_C4ON_LENGTH                                0x1
#define _CM4CON0_C4ON_MASK                                  0x80

// Register: CM4CON1
#define CM4CON1 CM4CON1
extern volatile unsigned char           CM4CON1             __at(0x11D);
#ifndef _LIB_BUILD
asm("CM4CON1 equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C4INTN                 :1;
        unsigned C4INTP                 :1;
    };
} CM4CON1bits_t;
extern volatile CM4CON1bits_t CM4CON1bits __at(0x11D);
// bitfield macros
#define _CM4CON1_INTN_POSN                                  0x0
#define _CM4CON1_INTN_POSITION                              0x0
#define _CM4CON1_INTN_SIZE                                  0x1
#define _CM4CON1_INTN_LENGTH                                0x1
#define _CM4CON1_INTN_MASK                                  0x1
#define _CM4CON1_INTP_POSN                                  0x1
#define _CM4CON1_INTP_POSITION                              0x1
#define _CM4CON1_INTP_SIZE                                  0x1
#define _CM4CON1_INTP_LENGTH                                0x1
#define _CM4CON1_INTP_MASK                                  0x2
#define _CM4CON1_C4INTN_POSN                                0x0
#define _CM4CON1_C4INTN_POSITION                            0x0
#define _CM4CON1_C4INTN_SIZE                                0x1
#define _CM4CON1_C4INTN_LENGTH                              0x1
#define _CM4CON1_C4INTN_MASK                                0x1
#define _CM4CON1_C4INTP_POSN                                0x1
#define _CM4CON1_C4INTP_POSITION                            0x1
#define _CM4CON1_C4INTP_SIZE                                0x1
#define _CM4CON1_C4INTP_LENGTH                              0x1
#define _CM4CON1_C4INTP_MASK                                0x2

// Register: CM4NSEL
#define CM4NSEL CM4NSEL
extern volatile unsigned char           CM4NSEL             __at(0x11E);
#ifndef _LIB_BUILD
asm("CM4NSEL equ 011Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :3;
    };
    struct {
        unsigned NCH0                   :1;
        unsigned NCH1                   :1;
        unsigned NCH2                   :1;
    };
    struct {
        unsigned C4NCH                  :3;
    };
    struct {
        unsigned C4NCH0                 :1;
        unsigned C4NCH1                 :1;
        unsigned C4NCH2                 :1;
    };
} CM4NSELbits_t;
