MikroElektronika/core_packages/PIC/XC8/def/PIC16F1768/mcu.h
// Register: DAC2CON0
#define DAC2CON0 DAC2CON0
extern volatile unsigned char           DAC2CON0            __at(0x594);
#ifndef _LIB_BUILD
asm("DAC2CON0 equ 0594h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned                        :1;
        unsigned OE1                    :1;
        unsigned FM                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned                        :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned                        :1;
        unsigned OE                     :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned                        :1;
        unsigned DACOE1                 :1;
        unsigned DACFM                  :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned                        :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
        unsigned                        :1;
        unsigned DACOE                  :1;
    };
    struct {
        unsigned DAC2NSS                :2;
        unsigned DAC2PSS                :2;
        unsigned                        :1;
        unsigned DAC2OE1                :1;
        unsigned DAC2FM                 :1;
        unsigned DAC2EN                 :1;
    };
    struct {
        unsigned DAC2NSS0               :1;
        unsigned                        :1;
        unsigned DAC2PSS0               :1;
        unsigned DAC2PSS1               :1;
    };
} DAC2CON0bits_t;
extern volatile DAC2CON0bits_t DAC2CON0bits __at(0x594);
// bitfield macros
#define _DAC2CON0_NSS_POSN                                  0x0
#define _DAC2CON0_NSS_POSITION                              0x0
#define _DAC2CON0_NSS_SIZE                                  0x2
#define _DAC2CON0_NSS_LENGTH                                0x2
#define _DAC2CON0_NSS_MASK                                  0x3
#define _DAC2CON0_PSS_POSN                                  0x2
#define _DAC2CON0_PSS_POSITION                              0x2
#define _DAC2CON0_PSS_SIZE                                  0x2
#define _DAC2CON0_PSS_LENGTH                                0x2
#define _DAC2CON0_PSS_MASK                                  0xC
#define _DAC2CON0_OE1_POSN                                  0x5
#define _DAC2CON0_OE1_POSITION                              0x5
#define _DAC2CON0_OE1_SIZE                                  0x1
#define _DAC2CON0_OE1_LENGTH                                0x1
#define _DAC2CON0_OE1_MASK                                  0x20
#define _DAC2CON0_FM_POSN                                   0x6
#define _DAC2CON0_FM_POSITION                               0x6
#define _DAC2CON0_FM_SIZE                                   0x1
#define _DAC2CON0_FM_LENGTH                                 0x1
#define _DAC2CON0_FM_MASK                                   0x40
#define _DAC2CON0_EN_POSN                                   0x7
#define _DAC2CON0_EN_POSITION                               0x7
#define _DAC2CON0_EN_SIZE                                   0x1
#define _DAC2CON0_EN_LENGTH                                 0x1
#define _DAC2CON0_EN_MASK                                   0x80
#define _DAC2CON0_NSS0_POSN                                 0x0
#define _DAC2CON0_NSS0_POSITION                             0x0
#define _DAC2CON0_NSS0_SIZE                                 0x1
#define _DAC2CON0_NSS0_LENGTH                               0x1
#define _DAC2CON0_NSS0_MASK                                 0x1
#define _DAC2CON0_PSS0_POSN                                 0x2
#define _DAC2CON0_PSS0_POSITION                             0x2
#define _DAC2CON0_PSS0_SIZE                                 0x1
#define _DAC2CON0_PSS0_LENGTH                               0x1
#define _DAC2CON0_PSS0_MASK                                 0x4
#define _DAC2CON0_PSS1_POSN                                 0x3
#define _DAC2CON0_PSS1_POSITION                             0x3
#define _DAC2CON0_PSS1_SIZE                                 0x1
#define _DAC2CON0_PSS1_LENGTH                               0x1
#define _DAC2CON0_PSS1_MASK                                 0x8
#define _DAC2CON0_OE_POSN                                   0x5
#define _DAC2CON0_OE_POSITION                               0x5
#define _DAC2CON0_OE_SIZE                                   0x1
#define _DAC2CON0_OE_LENGTH                                 0x1
#define _DAC2CON0_OE_MASK                                   0x20
#define _DAC2CON0_DACNSS_POSN                               0x0
#define _DAC2CON0_DACNSS_POSITION                           0x0
#define _DAC2CON0_DACNSS_SIZE                               0x2
#define _DAC2CON0_DACNSS_LENGTH                             0x2
#define _DAC2CON0_DACNSS_MASK                               0x3
#define _DAC2CON0_DACPSS_POSN                               0x2
#define _DAC2CON0_DACPSS_POSITION                           0x2
#define _DAC2CON0_DACPSS_SIZE                               0x2
#define _DAC2CON0_DACPSS_LENGTH                             0x2
#define _DAC2CON0_DACPSS_MASK                               0xC
#define _DAC2CON0_DACOE1_POSN                               0x5
#define _DAC2CON0_DACOE1_POSITION                           0x5
#define _DAC2CON0_DACOE1_SIZE                               0x1
#define _DAC2CON0_DACOE1_LENGTH                             0x1
#define _DAC2CON0_DACOE1_MASK                               0x20
#define _DAC2CON0_DACFM_POSN                                0x6
#define _DAC2CON0_DACFM_POSITION                            0x6
#define _DAC2CON0_DACFM_SIZE                                0x1
#define _DAC2CON0_DACFM_LENGTH                              0x1
#define _DAC2CON0_DACFM_MASK                                0x40
#define _DAC2CON0_DACEN_POSN                                0x7
#define _DAC2CON0_DACEN_POSITION                            0x7
#define _DAC2CON0_DACEN_SIZE                                0x1
#define _DAC2CON0_DACEN_LENGTH                              0x1
#define _DAC2CON0_DACEN_MASK                                0x80
#define _DAC2CON0_DACNSS0_POSN                              0x0
#define _DAC2CON0_DACNSS0_POSITION                          0x0
#define _DAC2CON0_DACNSS0_SIZE                              0x1
#define _DAC2CON0_DACNSS0_LENGTH                            0x1
#define _DAC2CON0_DACNSS0_MASK                              0x1
#define _DAC2CON0_DACPSS0_POSN                              0x2
#define _DAC2CON0_DACPSS0_POSITION                          0x2
#define _DAC2CON0_DACPSS0_SIZE                              0x1
#define _DAC2CON0_DACPSS0_LENGTH                            0x1
#define _DAC2CON0_DACPSS0_MASK                              0x4
#define _DAC2CON0_DACPSS1_POSN                              0x3
#define _DAC2CON0_DACPSS1_POSITION                          0x3
#define _DAC2CON0_DACPSS1_SIZE                              0x1
#define _DAC2CON0_DACPSS1_LENGTH                            0x1
#define _DAC2CON0_DACPSS1_MASK                              0x8
#define _DAC2CON0_DACOE_POSN                                0x5
#define _DAC2CON0_DACOE_POSITION                            0x5
#define _DAC2CON0_DACOE_SIZE                                0x1
#define _DAC2CON0_DACOE_LENGTH                              0x1
#define _DAC2CON0_DACOE_MASK                                0x20
#define _DAC2CON0_DAC2NSS_POSN                              0x0
#define _DAC2CON0_DAC2NSS_POSITION                          0x0
#define _DAC2CON0_DAC2NSS_SIZE                              0x2
#define _DAC2CON0_DAC2NSS_LENGTH                            0x2
#define _DAC2CON0_DAC2NSS_MASK                              0x3
#define _DAC2CON0_DAC2PSS_POSN                              0x2
#define _DAC2CON0_DAC2PSS_POSITION                          0x2
#define _DAC2CON0_DAC2PSS_SIZE                              0x2
#define _DAC2CON0_DAC2PSS_LENGTH                            0x2
#define _DAC2CON0_DAC2PSS_MASK                              0xC
#define _DAC2CON0_DAC2OE1_POSN                              0x5
#define _DAC2CON0_DAC2OE1_POSITION                          0x5
#define _DAC2CON0_DAC2OE1_SIZE                              0x1
#define _DAC2CON0_DAC2OE1_LENGTH                            0x1
#define _DAC2CON0_DAC2OE1_MASK                              0x20
#define _DAC2CON0_DAC2FM_POSN                               0x6
#define _DAC2CON0_DAC2FM_POSITION                           0x6
#define _DAC2CON0_DAC2FM_SIZE                               0x1
#define _DAC2CON0_DAC2FM_LENGTH                             0x1
#define _DAC2CON0_DAC2FM_MASK                               0x40
#define _DAC2CON0_DAC2EN_POSN                               0x7
#define _DAC2CON0_DAC2EN_POSITION                           0x7
#define _DAC2CON0_DAC2EN_SIZE                               0x1
#define _DAC2CON0_DAC2EN_LENGTH                             0x1
#define _DAC2CON0_DAC2EN_MASK                               0x80
#define _DAC2CON0_DAC2NSS0_POSN                             0x0
#define _DAC2CON0_DAC2NSS0_POSITION                         0x0
#define _DAC2CON0_DAC2NSS0_SIZE                             0x1
#define _DAC2CON0_DAC2NSS0_LENGTH                           0x1
#define _DAC2CON0_DAC2NSS0_MASK                             0x1
#define _DAC2CON0_DAC2PSS0_POSN                             0x2
#define _DAC2CON0_DAC2PSS0_POSITION                         0x2
#define _DAC2CON0_DAC2PSS0_SIZE                             0x1
#define _DAC2CON0_DAC2PSS0_LENGTH                           0x1
#define _DAC2CON0_DAC2PSS0_MASK                             0x4
#define _DAC2CON0_DAC2PSS1_POSN                             0x3
#define _DAC2CON0_DAC2PSS1_POSITION                         0x3
#define _DAC2CON0_DAC2PSS1_SIZE                             0x1
#define _DAC2CON0_DAC2PSS1_LENGTH                           0x1
#define _DAC2CON0_DAC2PSS1_MASK                             0x8

// Register: DAC2REF
#define DAC2REF DAC2REF
extern volatile unsigned short          DAC2REF             __at(0x595);
#ifndef _LIB_BUILD
asm("DAC2REF equ 0595h");
#endif

