MikroElektronika/core_packages/PIC/XC8/def/PIC16F1768/mcu.h
extern volatile DAC2REFHbits_t DAC2REFHbits __at(0x596);
// bitfield macros
#define _DAC2REFH_REF_POSN                                  0x0
#define _DAC2REFH_REF_POSITION                              0x0
#define _DAC2REFH_REF_SIZE                                  0x8
#define _DAC2REFH_REF_LENGTH                                0x8
#define _DAC2REFH_REF_MASK                                  0xFF
#define _DAC2REFH_DAC2REF8_POSN                             0x0
#define _DAC2REFH_DAC2REF8_POSITION                         0x0
#define _DAC2REFH_DAC2REF8_SIZE                             0x1
#define _DAC2REFH_DAC2REF8_LENGTH                           0x1
#define _DAC2REFH_DAC2REF8_MASK                             0x1
#define _DAC2REFH_DAC2REF9_POSN                             0x1
#define _DAC2REFH_DAC2REF9_POSITION                         0x1
#define _DAC2REFH_DAC2REF9_SIZE                             0x1
#define _DAC2REFH_DAC2REF9_LENGTH                           0x1
#define _DAC2REFH_DAC2REF9_MASK                             0x2
#define _DAC2REFH_DAC2REF10_POSN                            0x2
#define _DAC2REFH_DAC2REF10_POSITION                        0x2
#define _DAC2REFH_DAC2REF10_SIZE                            0x1
#define _DAC2REFH_DAC2REF10_LENGTH                          0x1
#define _DAC2REFH_DAC2REF10_MASK                            0x4
#define _DAC2REFH_DAC2REF11_POSN                            0x3
#define _DAC2REFH_DAC2REF11_POSITION                        0x3
#define _DAC2REFH_DAC2REF11_SIZE                            0x1
#define _DAC2REFH_DAC2REF11_LENGTH                          0x1
#define _DAC2REFH_DAC2REF11_MASK                            0x8
#define _DAC2REFH_DAC2REF12_POSN                            0x4
#define _DAC2REFH_DAC2REF12_POSITION                        0x4
#define _DAC2REFH_DAC2REF12_SIZE                            0x1
#define _DAC2REFH_DAC2REF12_LENGTH                          0x1
#define _DAC2REFH_DAC2REF12_MASK                            0x10
#define _DAC2REFH_DAC2REF13_POSN                            0x5
#define _DAC2REFH_DAC2REF13_POSITION                        0x5
#define _DAC2REFH_DAC2REF13_SIZE                            0x1
#define _DAC2REFH_DAC2REF13_LENGTH                          0x1
#define _DAC2REFH_DAC2REF13_MASK                            0x20
#define _DAC2REFH_DAC2REF14_POSN                            0x6
#define _DAC2REFH_DAC2REF14_POSITION                        0x6
#define _DAC2REFH_DAC2REF14_SIZE                            0x1
#define _DAC2REFH_DAC2REF14_LENGTH                          0x1
#define _DAC2REFH_DAC2REF14_MASK                            0x40
#define _DAC2REFH_DAC2REF15_POSN                            0x7
#define _DAC2REFH_DAC2REF15_POSITION                        0x7
#define _DAC2REFH_DAC2REF15_SIZE                            0x1
#define _DAC2REFH_DAC2REF15_LENGTH                          0x1
#define _DAC2REFH_DAC2REF15_MASK                            0x80
#define _DAC2REFH_R8_POSN                                   0x0
#define _DAC2REFH_R8_POSITION                               0x0
#define _DAC2REFH_R8_SIZE                                   0x1
#define _DAC2REFH_R8_LENGTH                                 0x1
#define _DAC2REFH_R8_MASK                                   0x1
#define _DAC2REFH_R9_POSN                                   0x1
#define _DAC2REFH_R9_POSITION                               0x1
#define _DAC2REFH_R9_SIZE                                   0x1
#define _DAC2REFH_R9_LENGTH                                 0x1
#define _DAC2REFH_R9_MASK                                   0x2
#define _DAC2REFH_R10_POSN                                  0x2
#define _DAC2REFH_R10_POSITION                              0x2
#define _DAC2REFH_R10_SIZE                                  0x1
#define _DAC2REFH_R10_LENGTH                                0x1
#define _DAC2REFH_R10_MASK                                  0x4
#define _DAC2REFH_R11_POSN                                  0x3
#define _DAC2REFH_R11_POSITION                              0x3
#define _DAC2REFH_R11_SIZE                                  0x1
#define _DAC2REFH_R11_LENGTH                                0x1
#define _DAC2REFH_R11_MASK                                  0x8
#define _DAC2REFH_R12_POSN                                  0x4
#define _DAC2REFH_R12_POSITION                              0x4
#define _DAC2REFH_R12_SIZE                                  0x1
#define _DAC2REFH_R12_LENGTH                                0x1
#define _DAC2REFH_R12_MASK                                  0x10
#define _DAC2REFH_R13_POSN                                  0x5
#define _DAC2REFH_R13_POSITION                              0x5
#define _DAC2REFH_R13_SIZE                                  0x1
#define _DAC2REFH_R13_LENGTH                                0x1
#define _DAC2REFH_R13_MASK                                  0x20
#define _DAC2REFH_R14_POSN                                  0x6
#define _DAC2REFH_R14_POSITION                              0x6
#define _DAC2REFH_R14_SIZE                                  0x1
#define _DAC2REFH_R14_LENGTH                                0x1
#define _DAC2REFH_R14_MASK                                  0x40
#define _DAC2REFH_R15_POSN                                  0x7
#define _DAC2REFH_R15_POSITION                              0x7
#define _DAC2REFH_R15_SIZE                                  0x1
#define _DAC2REFH_R15_LENGTH                                0x1
#define _DAC2REFH_R15_MASK                                  0x80
#define _DAC2REFH_DAC2R8_POSN                               0x0
#define _DAC2REFH_DAC2R8_POSITION                           0x0
#define _DAC2REFH_DAC2R8_SIZE                               0x1
#define _DAC2REFH_DAC2R8_LENGTH                             0x1
#define _DAC2REFH_DAC2R8_MASK                               0x1
#define _DAC2REFH_DAC2R9_POSN                               0x1
#define _DAC2REFH_DAC2R9_POSITION                           0x1
#define _DAC2REFH_DAC2R9_SIZE                               0x1
#define _DAC2REFH_DAC2R9_LENGTH                             0x1
#define _DAC2REFH_DAC2R9_MASK                               0x2
#define _DAC2REFH_DAC2R10_POSN                              0x2
#define _DAC2REFH_DAC2R10_POSITION                          0x2
#define _DAC2REFH_DAC2R10_SIZE                              0x1
#define _DAC2REFH_DAC2R10_LENGTH                            0x1
#define _DAC2REFH_DAC2R10_MASK                              0x4
#define _DAC2REFH_DAC2R11_POSN                              0x3
#define _DAC2REFH_DAC2R11_POSITION                          0x3
#define _DAC2REFH_DAC2R11_SIZE                              0x1
#define _DAC2REFH_DAC2R11_LENGTH                            0x1
#define _DAC2REFH_DAC2R11_MASK                              0x8
#define _DAC2REFH_DAC2R12_POSN                              0x4
#define _DAC2REFH_DAC2R12_POSITION                          0x4
#define _DAC2REFH_DAC2R12_SIZE                              0x1
#define _DAC2REFH_DAC2R12_LENGTH                            0x1
#define _DAC2REFH_DAC2R12_MASK                              0x10
#define _DAC2REFH_DAC2R13_POSN                              0x5
#define _DAC2REFH_DAC2R13_POSITION                          0x5
#define _DAC2REFH_DAC2R13_SIZE                              0x1
#define _DAC2REFH_DAC2R13_LENGTH                            0x1
#define _DAC2REFH_DAC2R13_MASK                              0x20
#define _DAC2REFH_DAC2R14_POSN                              0x6
#define _DAC2REFH_DAC2R14_POSITION                          0x6
#define _DAC2REFH_DAC2R14_SIZE                              0x1
#define _DAC2REFH_DAC2R14_LENGTH                            0x1
#define _DAC2REFH_DAC2R14_MASK                              0x40
#define _DAC2REFH_DAC2R15_POSN                              0x7
#define _DAC2REFH_DAC2R15_POSITION                          0x7
#define _DAC2REFH_DAC2R15_SIZE                              0x1
#define _DAC2REFH_DAC2R15_LENGTH                            0x1
#define _DAC2REFH_DAC2R15_MASK                              0x80
#define _DAC2REFH_REF8_POSN                                 0x0
#define _DAC2REFH_REF8_POSITION                             0x0
#define _DAC2REFH_REF8_SIZE                                 0x1
#define _DAC2REFH_REF8_LENGTH                               0x1
#define _DAC2REFH_REF8_MASK                                 0x1
#define _DAC2REFH_REF9_POSN                                 0x1
#define _DAC2REFH_REF9_POSITION                             0x1
#define _DAC2REFH_REF9_SIZE                                 0x1
#define _DAC2REFH_REF9_LENGTH                               0x1
#define _DAC2REFH_REF9_MASK                                 0x2
#define _DAC2REFH_REF10_POSN                                0x2
#define _DAC2REFH_REF10_POSITION                            0x2
#define _DAC2REFH_REF10_SIZE                                0x1
#define _DAC2REFH_REF10_LENGTH                              0x1
#define _DAC2REFH_REF10_MASK                                0x4
#define _DAC2REFH_REF11_POSN                                0x3
#define _DAC2REFH_REF11_POSITION                            0x3
#define _DAC2REFH_REF11_SIZE                                0x1
#define _DAC2REFH_REF11_LENGTH                              0x1
#define _DAC2REFH_REF11_MASK                                0x8
#define _DAC2REFH_REF12_POSN                                0x4
#define _DAC2REFH_REF12_POSITION                            0x4
#define _DAC2REFH_REF12_SIZE                                0x1
#define _DAC2REFH_REF12_LENGTH                              0x1
#define _DAC2REFH_REF12_MASK                                0x10
#define _DAC2REFH_REF13_POSN                                0x5
#define _DAC2REFH_REF13_POSITION                            0x5
#define _DAC2REFH_REF13_SIZE                                0x1
#define _DAC2REFH_REF13_LENGTH                              0x1
#define _DAC2REFH_REF13_MASK                                0x20
#define _DAC2REFH_REF14_POSN                                0x6
#define _DAC2REFH_REF14_POSITION                            0x6
#define _DAC2REFH_REF14_SIZE                                0x1
#define _DAC2REFH_REF14_LENGTH                              0x1
#define _DAC2REFH_REF14_MASK                                0x40
#define _DAC2REFH_REF15_POSN                                0x7
#define _DAC2REFH_REF15_POSITION                            0x7
#define _DAC2REFH_REF15_SIZE                                0x1
#define _DAC2REFH_REF15_LENGTH                              0x1
#define _DAC2REFH_REF15_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC2REF8               :1;
        unsigned DAC2REF9               :1;
        unsigned DAC2REF10              :1;
        unsigned DAC2REF11              :1;
        unsigned DAC2REF12              :1;
        unsigned DAC2REF13              :1;
        unsigned DAC2REF14              :1;
        unsigned DAC2REF15              :1;
    };
    struct {
        unsigned R8                     :1;
        unsigned R9                     :1;
        unsigned R10                    :1;
        unsigned R11                    :1;
        unsigned R12                    :1;
        unsigned R13                    :1;
        unsigned R14                    :1;
        unsigned R15                    :1;
    };
    struct {
        unsigned DAC2R8                 :1;
        unsigned DAC2R9                 :1;
        unsigned DAC2R10                :1;
        unsigned DAC2R11                :1;
        unsigned DAC2R12                :1;
        unsigned DAC2R13                :1;
        unsigned DAC2R14                :1;
        unsigned DAC2R15                :1;
    };
    struct {
        unsigned REF8                   :1;
        unsigned REF9                   :1;
        unsigned REF10                  :1;
        unsigned REF11                  :1;
        unsigned REF12                  :1;
        unsigned REF13                  :1;
        unsigned REF14                  :1;
        unsigned REF15                  :1;
    };
} DAC2CON2bits_t;
extern volatile DAC2CON2bits_t DAC2CON2bits __at(0x596);
// bitfield macros
#define _DAC2CON2_REF_POSN                                  0x0
#define _DAC2CON2_REF_POSITION                              0x0
#define _DAC2CON2_REF_SIZE                                  0x8
#define _DAC2CON2_REF_LENGTH                                0x8
#define _DAC2CON2_REF_MASK                                  0xFF
#define _DAC2CON2_DAC2REF8_POSN                             0x0
#define _DAC2CON2_DAC2REF8_POSITION                         0x0
#define _DAC2CON2_DAC2REF8_SIZE                             0x1
#define _DAC2CON2_DAC2REF8_LENGTH                           0x1
#define _DAC2CON2_DAC2REF8_MASK                             0x1
#define _DAC2CON2_DAC2REF9_POSN                             0x1
#define _DAC2CON2_DAC2REF9_POSITION                         0x1
#define _DAC2CON2_DAC2REF9_SIZE                             0x1
#define _DAC2CON2_DAC2REF9_LENGTH                           0x1
#define _DAC2CON2_DAC2REF9_MASK                             0x2
#define _DAC2CON2_DAC2REF10_POSN                            0x2
#define _DAC2CON2_DAC2REF10_POSITION                        0x2
#define _DAC2CON2_DAC2REF10_SIZE                            0x1
#define _DAC2CON2_DAC2REF10_LENGTH                          0x1
#define _DAC2CON2_DAC2REF10_MASK                            0x4
#define _DAC2CON2_DAC2REF11_POSN                            0x3
#define _DAC2CON2_DAC2REF11_POSITION                        0x3
#define _DAC2CON2_DAC2REF11_SIZE                            0x1
#define _DAC2CON2_DAC2REF11_LENGTH                          0x1
#define _DAC2CON2_DAC2REF11_MASK                            0x8
#define _DAC2CON2_DAC2REF12_POSN                            0x4
#define _DAC2CON2_DAC2REF12_POSITION                        0x4
#define _DAC2CON2_DAC2REF12_SIZE                            0x1
#define _DAC2CON2_DAC2REF12_LENGTH                          0x1
#define _DAC2CON2_DAC2REF12_MASK                            0x10
#define _DAC2CON2_DAC2REF13_POSN                            0x5
#define _DAC2CON2_DAC2REF13_POSITION                        0x5
#define _DAC2CON2_DAC2REF13_SIZE                            0x1
#define _DAC2CON2_DAC2REF13_LENGTH                          0x1
#define _DAC2CON2_DAC2REF13_MASK                            0x20
#define _DAC2CON2_DAC2REF14_POSN                            0x6
#define _DAC2CON2_DAC2REF14_POSITION                        0x6
#define _DAC2CON2_DAC2REF14_SIZE                            0x1
#define _DAC2CON2_DAC2REF14_LENGTH                          0x1
#define _DAC2CON2_DAC2REF14_MASK                            0x40
#define _DAC2CON2_DAC2REF15_POSN                            0x7
#define _DAC2CON2_DAC2REF15_POSITION                        0x7
#define _DAC2CON2_DAC2REF15_SIZE                            0x1
#define _DAC2CON2_DAC2REF15_LENGTH                          0x1
#define _DAC2CON2_DAC2REF15_MASK                            0x80
#define _DAC2CON2_R8_POSN                                   0x0
#define _DAC2CON2_R8_POSITION                               0x0
#define _DAC2CON2_R8_SIZE                                   0x1
#define _DAC2CON2_R8_LENGTH                                 0x1
#define _DAC2CON2_R8_MASK                                   0x1
#define _DAC2CON2_R9_POSN                                   0x1
#define _DAC2CON2_R9_POSITION                               0x1
#define _DAC2CON2_R9_SIZE                                   0x1
#define _DAC2CON2_R9_LENGTH                                 0x1
#define _DAC2CON2_R9_MASK                                   0x2
#define _DAC2CON2_R10_POSN                                  0x2
#define _DAC2CON2_R10_POSITION                              0x2
#define _DAC2CON2_R10_SIZE                                  0x1
#define _DAC2CON2_R10_LENGTH                                0x1
#define _DAC2CON2_R10_MASK                                  0x4
#define _DAC2CON2_R11_POSN                                  0x3
#define _DAC2CON2_R11_POSITION                              0x3
#define _DAC2CON2_R11_SIZE                                  0x1
#define _DAC2CON2_R11_LENGTH                                0x1
#define _DAC2CON2_R11_MASK                                  0x8
#define _DAC2CON2_R12_POSN                                  0x4
#define _DAC2CON2_R12_POSITION                              0x4
#define _DAC2CON2_R12_SIZE                                  0x1
#define _DAC2CON2_R12_LENGTH                                0x1
#define _DAC2CON2_R12_MASK                                  0x10
#define _DAC2CON2_R13_POSN                                  0x5
#define _DAC2CON2_R13_POSITION                              0x5
#define _DAC2CON2_R13_SIZE                                  0x1
#define _DAC2CON2_R13_LENGTH                                0x1
#define _DAC2CON2_R13_MASK                                  0x20
#define _DAC2CON2_R14_POSN                                  0x6
#define _DAC2CON2_R14_POSITION                              0x6
#define _DAC2CON2_R14_SIZE                                  0x1
#define _DAC2CON2_R14_LENGTH                                0x1
#define _DAC2CON2_R14_MASK                                  0x40
#define _DAC2CON2_R15_POSN                                  0x7
#define _DAC2CON2_R15_POSITION                              0x7
#define _DAC2CON2_R15_SIZE                                  0x1
#define _DAC2CON2_R15_LENGTH                                0x1
#define _DAC2CON2_R15_MASK                                  0x80
#define _DAC2CON2_DAC2R8_POSN                               0x0
#define _DAC2CON2_DAC2R8_POSITION                           0x0
#define _DAC2CON2_DAC2R8_SIZE                               0x1
#define _DAC2CON2_DAC2R8_LENGTH                             0x1
#define _DAC2CON2_DAC2R8_MASK                               0x1
#define _DAC2CON2_DAC2R9_POSN                               0x1
#define _DAC2CON2_DAC2R9_POSITION                           0x1
#define _DAC2CON2_DAC2R9_SIZE                               0x1
#define _DAC2CON2_DAC2R9_LENGTH                             0x1
#define _DAC2CON2_DAC2R9_MASK                               0x2
#define _DAC2CON2_DAC2R10_POSN                              0x2
#define _DAC2CON2_DAC2R10_POSITION                          0x2
#define _DAC2CON2_DAC2R10_SIZE                              0x1
#define _DAC2CON2_DAC2R10_LENGTH                            0x1
#define _DAC2CON2_DAC2R10_MASK                              0x4
#define _DAC2CON2_DAC2R11_POSN                              0x3
#define _DAC2CON2_DAC2R11_POSITION                          0x3
#define _DAC2CON2_DAC2R11_SIZE                              0x1
#define _DAC2CON2_DAC2R11_LENGTH                            0x1
#define _DAC2CON2_DAC2R11_MASK                              0x8
#define _DAC2CON2_DAC2R12_POSN                              0x4
#define _DAC2CON2_DAC2R12_POSITION                          0x4
#define _DAC2CON2_DAC2R12_SIZE                              0x1
#define _DAC2CON2_DAC2R12_LENGTH                            0x1
#define _DAC2CON2_DAC2R12_MASK                              0x10
#define _DAC2CON2_DAC2R13_POSN                              0x5
#define _DAC2CON2_DAC2R13_POSITION                          0x5
#define _DAC2CON2_DAC2R13_SIZE                              0x1
#define _DAC2CON2_DAC2R13_LENGTH                            0x1
#define _DAC2CON2_DAC2R13_MASK                              0x20
#define _DAC2CON2_DAC2R14_POSN                              0x6
#define _DAC2CON2_DAC2R14_POSITION                          0x6
#define _DAC2CON2_DAC2R14_SIZE                              0x1
#define _DAC2CON2_DAC2R14_LENGTH                            0x1
#define _DAC2CON2_DAC2R14_MASK                              0x40
#define _DAC2CON2_DAC2R15_POSN                              0x7
#define _DAC2CON2_DAC2R15_POSITION                          0x7
#define _DAC2CON2_DAC2R15_SIZE                              0x1
#define _DAC2CON2_DAC2R15_LENGTH                            0x1
#define _DAC2CON2_DAC2R15_MASK                              0x80
#define _DAC2CON2_REF8_POSN                                 0x0
#define _DAC2CON2_REF8_POSITION                             0x0
#define _DAC2CON2_REF8_SIZE                                 0x1
#define _DAC2CON2_REF8_LENGTH                               0x1
#define _DAC2CON2_REF8_MASK                                 0x1
#define _DAC2CON2_REF9_POSN                                 0x1
#define _DAC2CON2_REF9_POSITION                             0x1
#define _DAC2CON2_REF9_SIZE                                 0x1
#define _DAC2CON2_REF9_LENGTH                               0x1
#define _DAC2CON2_REF9_MASK                                 0x2
#define _DAC2CON2_REF10_POSN                                0x2
#define _DAC2CON2_REF10_POSITION                            0x2
#define _DAC2CON2_REF10_SIZE                                0x1
#define _DAC2CON2_REF10_LENGTH                              0x1
#define _DAC2CON2_REF10_MASK                                0x4
#define _DAC2CON2_REF11_POSN                                0x3
#define _DAC2CON2_REF11_POSITION                            0x3
#define _DAC2CON2_REF11_SIZE                                0x1
#define _DAC2CON2_REF11_LENGTH                              0x1
#define _DAC2CON2_REF11_MASK                                0x8
#define _DAC2CON2_REF12_POSN                                0x4
#define _DAC2CON2_REF12_POSITION                            0x4
#define _DAC2CON2_REF12_SIZE                                0x1
#define _DAC2CON2_REF12_LENGTH                              0x1
#define _DAC2CON2_REF12_MASK                                0x10
#define _DAC2CON2_REF13_POSN                                0x5
#define _DAC2CON2_REF13_POSITION                            0x5
#define _DAC2CON2_REF13_SIZE                                0x1
#define _DAC2CON2_REF13_LENGTH                              0x1
#define _DAC2CON2_REF13_MASK                                0x20
#define _DAC2CON2_REF14_POSN                                0x6
#define _DAC2CON2_REF14_POSITION                            0x6
#define _DAC2CON2_REF14_SIZE                                0x1
#define _DAC2CON2_REF14_LENGTH                              0x1
#define _DAC2CON2_REF14_MASK                                0x40
#define _DAC2CON2_REF15_POSN                                0x7
#define _DAC2CON2_REF15_POSITION                            0x7
#define _DAC2CON2_REF15_SIZE                                0x1
#define _DAC2CON2_REF15_LENGTH                              0x1
#define _DAC2CON2_REF15_MASK                                0x80

