MikroElektronika/core_packages/PIC/XC8/def/PIC16F1768/mcu.h
// Register: PWM5PRL
#define PWM5PRL PWM5PRL
extern volatile unsigned char           PWM5PRL             __at(0xD95);
#ifndef _LIB_BUILD
asm("PWM5PRL equ 0D95h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM5PRL0               :1;
        unsigned PWM5PRL1               :1;
        unsigned PWM5PRL2               :1;
        unsigned PWM5PRL3               :1;
        unsigned PWM5PRL4               :1;
        unsigned PWM5PRL5               :1;
        unsigned PWM5PRL6               :1;
        unsigned PWM5PRL7               :1;
    };
    struct {
        unsigned PWM5PRL                :8;
    };
} PWM5PRLbits_t;
extern volatile PWM5PRLbits_t PWM5PRLbits __at(0xD95);
// bitfield macros
#define _PWM5PRL_PR_POSN                                    0x0
#define _PWM5PRL_PR_POSITION                                0x0
#define _PWM5PRL_PR_SIZE                                    0x8
#define _PWM5PRL_PR_LENGTH                                  0x8
#define _PWM5PRL_PR_MASK                                    0xFF
#define _PWM5PRL_PWM5PRL0_POSN                              0x0
#define _PWM5PRL_PWM5PRL0_POSITION                          0x0
#define _PWM5PRL_PWM5PRL0_SIZE                              0x1
#define _PWM5PRL_PWM5PRL0_LENGTH                            0x1
#define _PWM5PRL_PWM5PRL0_MASK                              0x1
#define _PWM5PRL_PWM5PRL1_POSN                              0x1
#define _PWM5PRL_PWM5PRL1_POSITION                          0x1
#define _PWM5PRL_PWM5PRL1_SIZE                              0x1
#define _PWM5PRL_PWM5PRL1_LENGTH                            0x1
#define _PWM5PRL_PWM5PRL1_MASK                              0x2
#define _PWM5PRL_PWM5PRL2_POSN                              0x2
#define _PWM5PRL_PWM5PRL2_POSITION                          0x2
#define _PWM5PRL_PWM5PRL2_SIZE                              0x1
#define _PWM5PRL_PWM5PRL2_LENGTH                            0x1
#define _PWM5PRL_PWM5PRL2_MASK                              0x4
#define _PWM5PRL_PWM5PRL3_POSN                              0x3
#define _PWM5PRL_PWM5PRL3_POSITION                          0x3
#define _PWM5PRL_PWM5PRL3_SIZE                              0x1
#define _PWM5PRL_PWM5PRL3_LENGTH                            0x1
#define _PWM5PRL_PWM5PRL3_MASK                              0x8
#define _PWM5PRL_PWM5PRL4_POSN                              0x4
#define _PWM5PRL_PWM5PRL4_POSITION                          0x4
#define _PWM5PRL_PWM5PRL4_SIZE                              0x1
#define _PWM5PRL_PWM5PRL4_LENGTH                            0x1
#define _PWM5PRL_PWM5PRL4_MASK                              0x10
#define _PWM5PRL_PWM5PRL5_POSN                              0x5
#define _PWM5PRL_PWM5PRL5_POSITION                          0x5
#define _PWM5PRL_PWM5PRL5_SIZE                              0x1
#define _PWM5PRL_PWM5PRL5_LENGTH                            0x1
#define _PWM5PRL_PWM5PRL5_MASK                              0x20
#define _PWM5PRL_PWM5PRL6_POSN                              0x6
#define _PWM5PRL_PWM5PRL6_POSITION                          0x6
#define _PWM5PRL_PWM5PRL6_SIZE                              0x1
#define _PWM5PRL_PWM5PRL6_LENGTH                            0x1
#define _PWM5PRL_PWM5PRL6_MASK                              0x40
#define _PWM5PRL_PWM5PRL7_POSN                              0x7
#define _PWM5PRL_PWM5PRL7_POSITION                          0x7
#define _PWM5PRL_PWM5PRL7_SIZE                              0x1
#define _PWM5PRL_PWM5PRL7_LENGTH                            0x1
#define _PWM5PRL_PWM5PRL7_MASK                              0x80
#define _PWM5PRL_PWM5PRL_POSN                               0x0
#define _PWM5PRL_PWM5PRL_POSITION                           0x0
#define _PWM5PRL_PWM5PRL_SIZE                               0x8
#define _PWM5PRL_PWM5PRL_LENGTH                             0x8
#define _PWM5PRL_PWM5PRL_MASK                               0xFF

// Register: PWM5PRH
#define PWM5PRH PWM5PRH
extern volatile unsigned char           PWM5PRH             __at(0xD96);
#ifndef _LIB_BUILD
asm("PWM5PRH equ 0D96h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM5PRH0               :1;
        unsigned PWM5PRH1               :1;
        unsigned PWM5PRH2               :1;
        unsigned PWM5PRH3               :1;
        unsigned PWM5PRH4               :1;
        unsigned PWM5PRH5               :1;
        unsigned PWM5PRH6               :1;
        unsigned PWM5PRH7               :1;
    };
    struct {
        unsigned PWM5PRH                :8;
    };
} PWM5PRHbits_t;
extern volatile PWM5PRHbits_t PWM5PRHbits __at(0xD96);
// bitfield macros
#define _PWM5PRH_PR_POSN                                    0x0
#define _PWM5PRH_PR_POSITION                                0x0
#define _PWM5PRH_PR_SIZE                                    0x8
#define _PWM5PRH_PR_LENGTH                                  0x8
#define _PWM5PRH_PR_MASK                                    0xFF
#define _PWM5PRH_PWM5PRH0_POSN                              0x0
#define _PWM5PRH_PWM5PRH0_POSITION                          0x0
#define _PWM5PRH_PWM5PRH0_SIZE                              0x1
#define _PWM5PRH_PWM5PRH0_LENGTH                            0x1
#define _PWM5PRH_PWM5PRH0_MASK                              0x1
#define _PWM5PRH_PWM5PRH1_POSN                              0x1
#define _PWM5PRH_PWM5PRH1_POSITION                          0x1
#define _PWM5PRH_PWM5PRH1_SIZE                              0x1
#define _PWM5PRH_PWM5PRH1_LENGTH                            0x1
#define _PWM5PRH_PWM5PRH1_MASK                              0x2
#define _PWM5PRH_PWM5PRH2_POSN                              0x2
#define _PWM5PRH_PWM5PRH2_POSITION                          0x2
#define _PWM5PRH_PWM5PRH2_SIZE                              0x1
#define _PWM5PRH_PWM5PRH2_LENGTH                            0x1
#define _PWM5PRH_PWM5PRH2_MASK                              0x4
#define _PWM5PRH_PWM5PRH3_POSN                              0x3
#define _PWM5PRH_PWM5PRH3_POSITION                          0x3
#define _PWM5PRH_PWM5PRH3_SIZE                              0x1
#define _PWM5PRH_PWM5PRH3_LENGTH                            0x1
#define _PWM5PRH_PWM5PRH3_MASK                              0x8
#define _PWM5PRH_PWM5PRH4_POSN                              0x4
#define _PWM5PRH_PWM5PRH4_POSITION                          0x4
#define _PWM5PRH_PWM5PRH4_SIZE                              0x1
#define _PWM5PRH_PWM5PRH4_LENGTH                            0x1
#define _PWM5PRH_PWM5PRH4_MASK                              0x10
#define _PWM5PRH_PWM5PRH5_POSN                              0x5
#define _PWM5PRH_PWM5PRH5_POSITION                          0x5
#define _PWM5PRH_PWM5PRH5_SIZE                              0x1
#define _PWM5PRH_PWM5PRH5_LENGTH                            0x1
#define _PWM5PRH_PWM5PRH5_MASK                              0x20
#define _PWM5PRH_PWM5PRH6_POSN                              0x6
#define _PWM5PRH_PWM5PRH6_POSITION                          0x6
#define _PWM5PRH_PWM5PRH6_SIZE                              0x1
#define _PWM5PRH_PWM5PRH6_LENGTH                            0x1
#define _PWM5PRH_PWM5PRH6_MASK                              0x40
#define _PWM5PRH_PWM5PRH7_POSN                              0x7
#define _PWM5PRH_PWM5PRH7_POSITION                          0x7
#define _PWM5PRH_PWM5PRH7_SIZE                              0x1
#define _PWM5PRH_PWM5PRH7_LENGTH                            0x1
#define _PWM5PRH_PWM5PRH7_MASK                              0x80
#define _PWM5PRH_PWM5PRH_POSN                               0x0
#define _PWM5PRH_PWM5PRH_POSITION                           0x0
#define _PWM5PRH_PWM5PRH_SIZE                               0x8
#define _PWM5PRH_PWM5PRH_LENGTH                             0x8
#define _PWM5PRH_PWM5PRH_MASK                               0xFF

