MikroElektronika/core_packages/PIC/XC8/def/PIC16F1768/mcu.h
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// BAUD1CON<ABDEN>
extern volatile __bit                   ABDEN               __at(0xCF8);	// @ (0x19F * 8 + 0)
#define                                 ABDEN_bit           _BIT_ACCESS(BAUD1CON,0)
// BAUD1CON<ABDOVF>
extern volatile __bit                   ABDOVF              __at(0xCFF);	// @ (0x19F * 8 + 7)
#define                                 ABDOVF_bit          _BIT_ACCESS(BAUD1CON,7)
// SSP1CON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0x10B5);	// @ (0x216 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0x10B4);	// @ (0x216 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x10B6);	// @ (0x216 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSP1CON2,6)
// SSP1CON3<ACKTIM>
extern volatile __bit                   ACKTIM              __at(0x10BF);	// @ (0x217 * 8 + 7)
#define                                 ACKTIM_bit          _BIT_ACCESS(SSP1CON3,7)
// SSP1ADD<ADD0>
extern volatile __bit                   ADD0                __at(0x1090);	// @ (0x212 * 8 + 0)
#define                                 ADD0_bit            _BIT_ACCESS(SSP1ADD,0)
// SSP1ADD<ADD1>
extern volatile __bit                   ADD1                __at(0x1091);	// @ (0x212 * 8 + 1)
#define                                 ADD1_bit            _BIT_ACCESS(SSP1ADD,1)
// SSP1ADD<ADD2>
extern volatile __bit                   ADD2                __at(0x1092);	// @ (0x212 * 8 + 2)
#define                                 ADD2_bit            _BIT_ACCESS(SSP1ADD,2)
// SSP1ADD<ADD3>
extern volatile __bit                   ADD3                __at(0x1093);	// @ (0x212 * 8 + 3)
#define                                 ADD3_bit            _BIT_ACCESS(SSP1ADD,3)
// SSP1ADD<ADD4>
extern volatile __bit                   ADD4                __at(0x1094);	// @ (0x212 * 8 + 4)
#define                                 ADD4_bit            _BIT_ACCESS(SSP1ADD,4)
// SSP1ADD<ADD5>
extern volatile __bit                   ADD5                __at(0x1095);	// @ (0x212 * 8 + 5)
#define                                 ADD5_bit            _BIT_ACCESS(SSP1ADD,5)
// SSP1ADD<ADD6>
extern volatile __bit                   ADD6                __at(0x1096);	// @ (0x212 * 8 + 6)
#define                                 ADD6_bit            _BIT_ACCESS(SSP1ADD,6)
// SSP1ADD<ADD7>
extern volatile __bit                   ADD7                __at(0x1097);	// @ (0x212 * 8 + 7)
#define                                 ADD7_bit            _BIT_ACCESS(SSP1ADD,7)
// RC1STA<ADDEN>
extern volatile __bit                   ADDEN               __at(0xCEB);	// @ (0x19D * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RC1STA,3)
// ADCON1<ADFM>
extern volatile __bit                   ADFM                __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON1,7)
// ADCON0<ADGO>
extern volatile __bit                   ADGO                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 ADGO_bit            _BIT_ACCESS(ADCON0,1)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON1<ADNREF>
extern volatile __bit                   ADNREF              __at(0x4F2);	// @ (0x9E * 8 + 2)
#define                                 ADNREF_bit          _BIT_ACCESS(ADCON1,2)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADCON1<ADPREF0>
extern volatile __bit                   ADPREF0             __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 ADPREF0_bit         _BIT_ACCESS(ADCON1,0)
// ADCON1<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 ADPREF1_bit         _BIT_ACCESS(ADCON1,1)
// SSP1CON3<AHEN>
extern volatile __bit                   AHEN                __at(0x10B9);	// @ (0x217 * 8 + 1)
#define                                 AHEN_bit            _BIT_ACCESS(SSP1CON3,1)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xC64);	// @ (0x18C * 8 + 4)
#define                                 ANSA4_bit           _BIT_ACCESS(ANSELA,4)
// ANSELB<ANSB4>
extern volatile __bit                   ANSB4               __at(0xC6C);	// @ (0x18D * 8 + 4)
#define                                 ANSB4_bit           _BIT_ACCESS(ANSELB,4)
// ANSELB<ANSB5>
extern volatile __bit                   ANSB5               __at(0xC6D);	// @ (0x18D * 8 + 5)
#define                                 ANSB5_bit           _BIT_ACCESS(ANSELB,5)
// ANSELB<ANSB6>
extern volatile __bit                   ANSB6               __at(0xC6E);	// @ (0x18D * 8 + 6)
#define                                 ANSB6_bit           _BIT_ACCESS(ANSELB,6)
// ANSELB<ANSB7>
extern volatile __bit                   ANSB7               __at(0xC6F);	// @ (0x18D * 8 + 7)
#define                                 ANSB7_bit           _BIT_ACCESS(ANSELB,7)
// ANSELC<ANSC0>
extern volatile __bit                   ANSC0               __at(0xC70);	// @ (0x18E * 8 + 0)
#define                                 ANSC0_bit           _BIT_ACCESS(ANSELC,0)
// ANSELC<ANSC1>
extern volatile __bit                   ANSC1               __at(0xC71);	// @ (0x18E * 8 + 1)
#define                                 ANSC1_bit           _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSC2>
extern volatile __bit                   ANSC2               __at(0xC72);	// @ (0x18E * 8 + 2)
#define                                 ANSC2_bit           _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSC3>
extern volatile __bit                   ANSC3               __at(0xC73);	// @ (0x18E * 8 + 3)
#define                                 ANSC3_bit           _BIT_ACCESS(ANSELC,3)
// ANSELC<ANSC6>
extern volatile __bit                   ANSC6               __at(0xC76);	// @ (0x18E * 8 + 6)
#define                                 ANSC6_bit           _BIT_ACCESS(ANSELC,6)
// ANSELC<ANSC7>
extern volatile __bit                   ANSC7               __at(0xC77);	// @ (0x18E * 8 + 7)
#define                                 ANSC7_bit           _BIT_ACCESS(ANSELC,7)
// PIE2<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x493);	// @ (0x92 * 8 + 3)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x93);	// @ (0x12 * 8 + 3)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR2,3)
// SSP1STAT<BF>
extern volatile __bit                   BF                  __at(0x10A0);	// @ (0x214 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSP1STAT,0)
// SSP1CON3<BOEN>
extern volatile __bit                   BOEN                __at(0x10BC);	// @ (0x217 * 8 + 4)
#define                                 BOEN_bit            _BIT_ACCESS(SSP1CON3,4)
// BORCON<BORFS>
extern volatile __bit                   BORFS               __at(0x10EE);	// @ (0x21D * 8 + 6)
#define                                 BORFS_bit           _BIT_ACCESS(BORCON,6)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x10E8);	// @ (0x21D * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// BAUD1CON<BRG16>
extern volatile __bit                   BRG16               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUD1CON,3)
// TX1STA<BRGH>
extern volatile __bit                   BRGH                __at(0xCF2);	// @ (0x19E * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TX1STA,2)
// BSR<BSR0>
extern volatile __bit                   BSR0                __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 BSR0_bit            _BIT_ACCESS(BSR,0)
// BSR<BSR1>
extern volatile __bit                   BSR1                __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 BSR1_bit            _BIT_ACCESS(BSR,1)
// BSR<BSR2>
extern volatile __bit                   BSR2                __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 BSR2_bit            _BIT_ACCESS(BSR,2)
// BSR<BSR3>
extern volatile __bit                   BSR3                __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 BSR3_bit            _BIT_ACCESS(BSR,3)
// BSR<BSR4>
extern volatile __bit                   BSR4                __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 BSR4_bit            _BIT_ACCESS(BSR,4)
// SSP1BUF<BUF0>
extern volatile __bit                   BUF0                __at(0x1088);	// @ (0x211 * 8 + 0)
#define                                 BUF0_bit            _BIT_ACCESS(SSP1BUF,0)
// SSP1BUF<BUF1>
extern volatile __bit                   BUF1                __at(0x1089);	// @ (0x211 * 8 + 1)
#define                                 BUF1_bit            _BIT_ACCESS(SSP1BUF,1)
// SSP1BUF<BUF2>
extern volatile __bit                   BUF2                __at(0x108A);	// @ (0x211 * 8 + 2)
#define                                 BUF2_bit            _BIT_ACCESS(SSP1BUF,2)
// SSP1BUF<BUF3>
extern volatile __bit                   BUF3                __at(0x108B);	// @ (0x211 * 8 + 3)
#define                                 BUF3_bit            _BIT_ACCESS(SSP1BUF,3)
// SSP1BUF<BUF4>
extern volatile __bit                   BUF4                __at(0x108C);	// @ (0x211 * 8 + 4)
#define                                 BUF4_bit            _BIT_ACCESS(SSP1BUF,4)
// SSP1BUF<BUF5>
extern volatile __bit                   BUF5                __at(0x108D);	// @ (0x211 * 8 + 5)
#define                                 BUF5_bit            _BIT_ACCESS(SSP1BUF,5)
// SSP1BUF<BUF6>
extern volatile __bit                   BUF6                __at(0x108E);	// @ (0x211 * 8 + 6)
#define                                 BUF6_bit            _BIT_ACCESS(SSP1BUF,6)
// SSP1BUF<BUF7>
extern volatile __bit                   BUF7                __at(0x108F);	// @ (0x211 * 8 + 7)
#define                                 BUF7_bit            _BIT_ACCESS(SSP1BUF,7)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x495);	// @ (0x92 * 8 + 5)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,5)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x95);	// @ (0x12 * 8 + 5)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,5)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// CM1NSEL<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NSEL,0)
// CM1NSEL<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NSEL,1)
// CM1NSEL<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x892);	// @ (0x112 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NSEL,2)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1PSEL<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x898);	// @ (0x113 * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PSEL,0)
// CM1PSEL<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x899);	// @ (0x113 * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PSEL,1)
// CM1PSEL<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x89A);	// @ (0x113 * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PSEL,2)
// CM1PSEL<C1PCH3>
extern volatile __bit                   C1PCH3              __at(0x89B);	// @ (0x113 * 8 + 3)
#define                                 C1PCH3_bit          _BIT_ACCESS(CM1PSEL,3)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x884);	// @ (0x110 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CCPTMRS<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x14F0);	// @ (0x29E * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS,0)
// CCPTMRS<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x14F1);	// @ (0x29E * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS,1)
// CM1CON0<C1ZLF>
extern volatile __bit                   C1ZLF               __at(0x883);	// @ (0x110 * 8 + 3)
#define                                 C1ZLF_bit           _BIT_ACCESS(CM1CON0,3)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x496);	// @ (0x92 * 8 + 6)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x96);	// @ (0x12 * 8 + 6)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,6)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,1)
// CM2NSEL<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x8B0);	// @ (0x116 * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2NSEL,0)
// CM2NSEL<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x8B1);	// @ (0x116 * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2NSEL,1)
// CM2NSEL<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x8B2);	// @ (0x116 * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2NSEL,2)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x8A7);	// @ (0x114 * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x8A6);	// @ (0x114 * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2PSEL<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2PSEL,0)
// CM2PSEL<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2PSEL,1)
// CM2PSEL<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2PSEL,2)
// CM2PSEL<C2PCH3>
extern volatile __bit                   C2PCH3              __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 C2PCH3_bit          _BIT_ACCESS(CM2PSEL,3)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x8A4);	// @ (0x114 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x8A2);	// @ (0x114 * 8 + 2)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CCPTMRS<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x14F2);	// @ (0x29E * 8 + 2)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS,2)
// CCPTMRS<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x14F3);	// @ (0x29E * 8 + 3)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS,3)
// CM2CON0<C2ZLF>
extern volatile __bit                   C2ZLF               __at(0x8A3);	// @ (0x114 * 8 + 3)
#define                                 C2ZLF_bit           _BIT_ACCESS(CM2CON0,3)
// CM3CON0<C3HYS>
extern volatile __bit                   C3HYS               __at(0x8C1);	// @ (0x118 * 8 + 1)
#define                                 C3HYS_bit           _BIT_ACCESS(CM3CON0,1)
// PIE2<C3IE>
extern volatile __bit                   C3IE                __at(0x491);	// @ (0x92 * 8 + 1)
#define                                 C3IE_bit            _BIT_ACCESS(PIE2,1)
// PIR2<C3IF>
extern volatile __bit                   C3IF                __at(0x91);	// @ (0x12 * 8 + 1)
#define                                 C3IF_bit            _BIT_ACCESS(PIR2,1)
// CM3CON1<C3INTN>
extern volatile __bit                   C3INTN              __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 C3INTN_bit          _BIT_ACCESS(CM3CON1,0)
// CM3CON1<C3INTP>
extern volatile __bit                   C3INTP              __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 C3INTP_bit          _BIT_ACCESS(CM3CON1,1)
// CM3NSEL<C3NCH0>
extern volatile __bit                   C3NCH0              __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 C3NCH0_bit          _BIT_ACCESS(CM3NSEL,0)
// CM3NSEL<C3NCH1>
extern volatile __bit                   C3NCH1              __at(0x8D1);	// @ (0x11A * 8 + 1)
#define                                 C3NCH1_bit          _BIT_ACCESS(CM3NSEL,1)
// CM3NSEL<C3NCH2>
extern volatile __bit                   C3NCH2              __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 C3NCH2_bit          _BIT_ACCESS(CM3NSEL,2)
// CM3CON0<C3ON>
extern volatile __bit                   C3ON                __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 C3ON_bit            _BIT_ACCESS(CM3CON0,7)
// CM3CON0<C3OUT>
extern volatile __bit                   C3OUT               __at(0x8C6);	// @ (0x118 * 8 + 6)
#define                                 C3OUT_bit           _BIT_ACCESS(CM3CON0,6)
// CM3PSEL<C3PCH0>
extern volatile __bit                   C3PCH0              __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 C3PCH0_bit          _BIT_ACCESS(CM3PSEL,0)
// CM3PSEL<C3PCH1>
extern volatile __bit                   C3PCH1              __at(0x8D9);	// @ (0x11B * 8 + 1)
#define                                 C3PCH1_bit          _BIT_ACCESS(CM3PSEL,1)
// CM3PSEL<C3PCH2>
extern volatile __bit                   C3PCH2              __at(0x8DA);	// @ (0x11B * 8 + 2)
#define                                 C3PCH2_bit          _BIT_ACCESS(CM3PSEL,2)
// CM3PSEL<C3PCH3>
extern volatile __bit                   C3PCH3              __at(0x8DB);	// @ (0x11B * 8 + 3)
#define                                 C3PCH3_bit          _BIT_ACCESS(CM3PSEL,3)
// CM3CON0<C3POL>
extern volatile __bit                   C3POL               __at(0x8C4);	// @ (0x118 * 8 + 4)
#define                                 C3POL_bit           _BIT_ACCESS(CM3CON0,4)
// CM3CON0<C3SP>
extern volatile __bit                   C3SP                __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 C3SP_bit            _BIT_ACCESS(CM3CON0,2)
// CM3CON0<C3SYNC>
extern volatile __bit                   C3SYNC              __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 C3SYNC_bit          _BIT_ACCESS(CM3CON0,0)
// CM3CON0<C3ZLF>
extern volatile __bit                   C3ZLF               __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 C3ZLF_bit           _BIT_ACCESS(CM3CON0,3)
// CM4CON0<C4HYS>
extern volatile __bit                   C4HYS               __at(0x8E1);	// @ (0x11C * 8 + 1)
#define                                 C4HYS_bit           _BIT_ACCESS(CM4CON0,1)
// PIE2<C4IE>
extern volatile __bit                   C4IE                __at(0x492);	// @ (0x92 * 8 + 2)
#define                                 C4IE_bit            _BIT_ACCESS(PIE2,2)
// PIR2<C4IF>
extern volatile __bit                   C4IF                __at(0x92);	// @ (0x12 * 8 + 2)
#define                                 C4IF_bit            _BIT_ACCESS(PIR2,2)
// CM4CON1<C4INTN>
extern volatile __bit                   C4INTN              __at(0x8E8);	// @ (0x11D * 8 + 0)
#define                                 C4INTN_bit          _BIT_ACCESS(CM4CON1,0)
// CM4CON1<C4INTP>
extern volatile __bit                   C4INTP              __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 C4INTP_bit          _BIT_ACCESS(CM4CON1,1)
// CM4NSEL<C4NCH0>
