MikroElektronika/core_packages/PIC/XC8/def/PIC16F1768/mcu.h
extern volatile __bit                   PWM6PRL3            __at(0x6D2B);	// @ (0xDA5 * 8 + 3)
#define                                 PWM6PRL3_bit        _BIT_ACCESS(PWM6PRL,3)
// PWM6PRL<PWM6PRL4>
extern volatile __bit                   PWM6PRL4            __at(0x6D2C);	// @ (0xDA5 * 8 + 4)
#define                                 PWM6PRL4_bit        _BIT_ACCESS(PWM6PRL,4)
// PWM6PRL<PWM6PRL5>
extern volatile __bit                   PWM6PRL5            __at(0x6D2D);	// @ (0xDA5 * 8 + 5)
#define                                 PWM6PRL5_bit        _BIT_ACCESS(PWM6PRL,5)
// PWM6PRL<PWM6PRL6>
extern volatile __bit                   PWM6PRL6            __at(0x6D2E);	// @ (0xDA5 * 8 + 6)
#define                                 PWM6PRL6_bit        _BIT_ACCESS(PWM6PRL,6)
// PWM6PRL<PWM6PRL7>
extern volatile __bit                   PWM6PRL7            __at(0x6D2F);	// @ (0xDA5 * 8 + 7)
#define                                 PWM6PRL7_bit        _BIT_ACCESS(PWM6PRL,7)
// PWM6CLKCON<PWM6PS0>
extern volatile __bit                   PWM6PS0             __at(0x6D74);	// @ (0xDAE * 8 + 4)
#define                                 PWM6PS0_bit         _BIT_ACCESS(PWM6CLKCON,4)
// PWM6CLKCON<PWM6PS1>
extern volatile __bit                   PWM6PS1             __at(0x6D75);	// @ (0xDAE * 8 + 5)
#define                                 PWM6PS1_bit         _BIT_ACCESS(PWM6CLKCON,5)
// PWM6CLKCON<PWM6PS2>
extern volatile __bit                   PWM6PS2             __at(0x6D76);	// @ (0xDAE * 8 + 6)
#define                                 PWM6PS2_bit         _BIT_ACCESS(PWM6CLKCON,6)
// PWM6TMRH<PWM6TMRH0>
extern volatile __bit                   PWM6TMRH0           __at(0x6D50);	// @ (0xDAA * 8 + 0)
#define                                 PWM6TMRH0_bit       _BIT_ACCESS(PWM6TMRH,0)
// PWM6TMRH<PWM6TMRH1>
extern volatile __bit                   PWM6TMRH1           __at(0x6D51);	// @ (0xDAA * 8 + 1)
#define                                 PWM6TMRH1_bit       _BIT_ACCESS(PWM6TMRH,1)
// PWM6TMRH<PWM6TMRH2>
extern volatile __bit                   PWM6TMRH2           __at(0x6D52);	// @ (0xDAA * 8 + 2)
#define                                 PWM6TMRH2_bit       _BIT_ACCESS(PWM6TMRH,2)
// PWM6TMRH<PWM6TMRH3>
extern volatile __bit                   PWM6TMRH3           __at(0x6D53);	// @ (0xDAA * 8 + 3)
#define                                 PWM6TMRH3_bit       _BIT_ACCESS(PWM6TMRH,3)
// PWM6TMRH<PWM6TMRH4>
extern volatile __bit                   PWM6TMRH4           __at(0x6D54);	// @ (0xDAA * 8 + 4)
#define                                 PWM6TMRH4_bit       _BIT_ACCESS(PWM6TMRH,4)
// PWM6TMRH<PWM6TMRH5>
extern volatile __bit                   PWM6TMRH5           __at(0x6D55);	// @ (0xDAA * 8 + 5)
#define                                 PWM6TMRH5_bit       _BIT_ACCESS(PWM6TMRH,5)
// PWM6TMRH<PWM6TMRH6>
extern volatile __bit                   PWM6TMRH6           __at(0x6D56);	// @ (0xDAA * 8 + 6)
#define                                 PWM6TMRH6_bit       _BIT_ACCESS(PWM6TMRH,6)
// PWM6TMRH<PWM6TMRH7>
extern volatile __bit                   PWM6TMRH7           __at(0x6D57);	// @ (0xDAA * 8 + 7)
#define                                 PWM6TMRH7_bit       _BIT_ACCESS(PWM6TMRH,7)
// PWM6TMRL<PWM6TMRL0>
extern volatile __bit                   PWM6TMRL0           __at(0x6D48);	// @ (0xDA9 * 8 + 0)
#define                                 PWM6TMRL0_bit       _BIT_ACCESS(PWM6TMRL,0)
// PWM6TMRL<PWM6TMRL1>
extern volatile __bit                   PWM6TMRL1           __at(0x6D49);	// @ (0xDA9 * 8 + 1)
#define                                 PWM6TMRL1_bit       _BIT_ACCESS(PWM6TMRL,1)
// PWM6TMRL<PWM6TMRL2>
extern volatile __bit                   PWM6TMRL2           __at(0x6D4A);	// @ (0xDA9 * 8 + 2)
#define                                 PWM6TMRL2_bit       _BIT_ACCESS(PWM6TMRL,2)
// PWM6TMRL<PWM6TMRL3>
extern volatile __bit                   PWM6TMRL3           __at(0x6D4B);	// @ (0xDA9 * 8 + 3)
#define                                 PWM6TMRL3_bit       _BIT_ACCESS(PWM6TMRL,3)
// PWM6TMRL<PWM6TMRL4>
extern volatile __bit                   PWM6TMRL4           __at(0x6D4C);	// @ (0xDA9 * 8 + 4)
#define                                 PWM6TMRL4_bit       _BIT_ACCESS(PWM6TMRL,4)
// PWM6TMRL<PWM6TMRL5>
extern volatile __bit                   PWM6TMRL5           __at(0x6D4D);	// @ (0xDA9 * 8 + 5)
#define                                 PWM6TMRL5_bit       _BIT_ACCESS(PWM6TMRL,5)
// PWM6TMRL<PWM6TMRL6>
extern volatile __bit                   PWM6TMRL6           __at(0x6D4E);	// @ (0xDA9 * 8 + 6)
#define                                 PWM6TMRL6_bit       _BIT_ACCESS(PWM6TMRL,6)
// PWM6TMRL<PWM6TMRL7>
extern volatile __bit                   PWM6TMRL7           __at(0x6D4F);	// @ (0xDA9 * 8 + 7)
#define                                 PWM6TMRL7_bit       _BIT_ACCESS(PWM6TMRL,7)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x10B3);	// @ (0x216 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0xCFE);	// @ (0x19F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// PMCON1<RD>
extern volatile __bit                   RD                  __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(PMCON1,0)
// PRG1CON0<RG1EN>
extern volatile __bit                   RG1EN               __at(0x3CBF);	// @ (0x797 * 8 + 7)
#define                                 RG1EN_bit           _BIT_ACCESS(PRG1CON0,7)
// PRG1CON0<RG1FEDG>
extern volatile __bit                   RG1FEDG             __at(0x3CBD);	// @ (0x797 * 8 + 5)
#define                                 RG1FEDG_bit         _BIT_ACCESS(PRG1CON0,5)
// PRG1CON1<RG1FPOL>
extern volatile __bit                   RG1FPOL             __at(0x3CC1);	// @ (0x798 * 8 + 1)
#define                                 RG1FPOL_bit         _BIT_ACCESS(PRG1CON1,1)
// PRG1FTSS<RG1FTSS0>
extern volatile __bit                   RG1FTSS0            __at(0x3CA8);	// @ (0x795 * 8 + 0)
#define                                 RG1FTSS0_bit        _BIT_ACCESS(PRG1FTSS,0)
// PRG1FTSS<RG1FTSS1>
extern volatile __bit                   RG1FTSS1            __at(0x3CA9);	// @ (0x795 * 8 + 1)
#define                                 RG1FTSS1_bit        _BIT_ACCESS(PRG1FTSS,1)
// PRG1FTSS<RG1FTSS2>
extern volatile __bit                   RG1FTSS2            __at(0x3CAA);	// @ (0x795 * 8 + 2)
#define                                 RG1FTSS2_bit        _BIT_ACCESS(PRG1FTSS,2)
// PRG1FTSS<RG1FTSS3>
extern volatile __bit                   RG1FTSS3            __at(0x3CAB);	// @ (0x795 * 8 + 3)
#define                                 RG1FTSS3_bit        _BIT_ACCESS(PRG1FTSS,3)
// PRG1CON0<RG1GO>
extern volatile __bit                   RG1GO               __at(0x3CB8);	// @ (0x797 * 8 + 0)
#define                                 RG1GO_bit           _BIT_ACCESS(PRG1CON0,0)
// PRG1INS<RG1INS0>
extern volatile __bit                   RG1INS0             __at(0x3CB0);	// @ (0x796 * 8 + 0)
#define                                 RG1INS0_bit         _BIT_ACCESS(PRG1INS,0)
// PRG1INS<RG1INS1>
extern volatile __bit                   RG1INS1             __at(0x3CB1);	// @ (0x796 * 8 + 1)
#define                                 RG1INS1_bit         _BIT_ACCESS(PRG1INS,1)
// PRG1INS<RG1INS2>
extern volatile __bit                   RG1INS2             __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 RG1INS2_bit         _BIT_ACCESS(PRG1INS,2)
// PRG1INS<RG1INS3>
extern volatile __bit                   RG1INS3             __at(0x3CB3);	// @ (0x796 * 8 + 3)
#define                                 RG1INS3_bit         _BIT_ACCESS(PRG1INS,3)
// PRG1CON2<RG1ISET0>
extern volatile __bit                   RG1ISET0            __at(0x3CC8);	// @ (0x799 * 8 + 0)
#define                                 RG1ISET0_bit        _BIT_ACCESS(PRG1CON2,0)
// PRG1CON2<RG1ISET1>
extern volatile __bit                   RG1ISET1            __at(0x3CC9);	// @ (0x799 * 8 + 1)
#define                                 RG1ISET1_bit        _BIT_ACCESS(PRG1CON2,1)
// PRG1CON2<RG1ISET2>
extern volatile __bit                   RG1ISET2            __at(0x3CCA);	// @ (0x799 * 8 + 2)
#define                                 RG1ISET2_bit        _BIT_ACCESS(PRG1CON2,2)
// PRG1CON2<RG1ISET3>
extern volatile __bit                   RG1ISET3            __at(0x3CCB);	// @ (0x799 * 8 + 3)
#define                                 RG1ISET3_bit        _BIT_ACCESS(PRG1CON2,3)
// PRG1CON2<RG1ISET4>
extern volatile __bit                   RG1ISET4            __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 RG1ISET4_bit        _BIT_ACCESS(PRG1CON2,4)
// PRG1CON0<RG1MODE0>
extern volatile __bit                   RG1MODE0            __at(0x3CBA);	// @ (0x797 * 8 + 2)
#define                                 RG1MODE0_bit        _BIT_ACCESS(PRG1CON0,2)
// PRG1CON0<RG1MODE1>
extern volatile __bit                   RG1MODE1            __at(0x3CBB);	// @ (0x797 * 8 + 3)
#define                                 RG1MODE1_bit        _BIT_ACCESS(PRG1CON0,3)
// PRG1CON0<RG1OS>
extern volatile __bit                   RG1OS               __at(0x3CB9);	// @ (0x797 * 8 + 1)
#define                                 RG1OS_bit           _BIT_ACCESS(PRG1CON0,1)
// PRG1CON1<RG1RDY>
extern volatile __bit                   RG1RDY              __at(0x3CC2);	// @ (0x798 * 8 + 2)
#define                                 RG1RDY_bit          _BIT_ACCESS(PRG1CON1,2)
// PRG1CON0<RG1REDG>
extern volatile __bit                   RG1REDG             __at(0x3CBC);	// @ (0x797 * 8 + 4)
#define                                 RG1REDG_bit         _BIT_ACCESS(PRG1CON0,4)
// PRG1CON1<RG1RPOL>
extern volatile __bit                   RG1RPOL             __at(0x3CC0);	// @ (0x798 * 8 + 0)
#define                                 RG1RPOL_bit         _BIT_ACCESS(PRG1CON1,0)
// PRG1RTSS<RG1RTSS0>
extern volatile __bit                   RG1RTSS0            __at(0x3CA0);	// @ (0x794 * 8 + 0)
#define                                 RG1RTSS0_bit        _BIT_ACCESS(PRG1RTSS,0)
// PRG1RTSS<RG1RTSS1>
extern volatile __bit                   RG1RTSS1            __at(0x3CA1);	// @ (0x794 * 8 + 1)
#define                                 RG1RTSS1_bit        _BIT_ACCESS(PRG1RTSS,1)
// PRG1RTSS<RG1RTSS2>
extern volatile __bit                   RG1RTSS2            __at(0x3CA2);	// @ (0x794 * 8 + 2)
#define                                 RG1RTSS2_bit        _BIT_ACCESS(PRG1RTSS,2)
// PRG1RTSS<RG1RTSS3>
extern volatile __bit                   RG1RTSS3            __at(0x3CA3);	// @ (0x794 * 8 + 3)
#define                                 RG1RTSS3_bit        _BIT_ACCESS(PRG1RTSS,3)
// PRG2CON0<RG2EN>
extern volatile __bit                   RG2EN               __at(0x3CEF);	// @ (0x79D * 8 + 7)
#define                                 RG2EN_bit           _BIT_ACCESS(PRG2CON0,7)
// PRG2CON0<RG2FEDG>
extern volatile __bit                   RG2FEDG             __at(0x3CED);	// @ (0x79D * 8 + 5)
#define                                 RG2FEDG_bit         _BIT_ACCESS(PRG2CON0,5)
// PRG2CON1<RG2FPOL>
extern volatile __bit                   RG2FPOL             __at(0x3CF1);	// @ (0x79E * 8 + 1)
#define                                 RG2FPOL_bit         _BIT_ACCESS(PRG2CON1,1)
// PRG2FTSS<RG2FTSS0>
extern volatile __bit                   RG2FTSS0            __at(0x3CD8);	// @ (0x79B * 8 + 0)
#define                                 RG2FTSS0_bit        _BIT_ACCESS(PRG2FTSS,0)
// PRG2FTSS<RG2FTSS1>
extern volatile __bit                   RG2FTSS1            __at(0x3CD9);	// @ (0x79B * 8 + 1)
#define                                 RG2FTSS1_bit        _BIT_ACCESS(PRG2FTSS,1)
// PRG2FTSS<RG2FTSS2>
extern volatile __bit                   RG2FTSS2            __at(0x3CDA);	// @ (0x79B * 8 + 2)
#define                                 RG2FTSS2_bit        _BIT_ACCESS(PRG2FTSS,2)
// PRG2FTSS<RG2FTSS3>
extern volatile __bit                   RG2FTSS3            __at(0x3CDB);	// @ (0x79B * 8 + 3)
#define                                 RG2FTSS3_bit        _BIT_ACCESS(PRG2FTSS,3)
// PRG2CON0<RG2GO>
extern volatile __bit                   RG2GO               __at(0x3CE8);	// @ (0x79D * 8 + 0)
#define                                 RG2GO_bit           _BIT_ACCESS(PRG2CON0,0)
// PRG2INS<RG2INS0>
extern volatile __bit                   RG2INS0             __at(0x3CE0);	// @ (0x79C * 8 + 0)
#define                                 RG2INS0_bit         _BIT_ACCESS(PRG2INS,0)
// PRG2INS<RG2INS1>
extern volatile __bit                   RG2INS1             __at(0x3CE1);	// @ (0x79C * 8 + 1)
#define                                 RG2INS1_bit         _BIT_ACCESS(PRG2INS,1)
// PRG2INS<RG2INS2>
extern volatile __bit                   RG2INS2             __at(0x3CE2);	// @ (0x79C * 8 + 2)
#define                                 RG2INS2_bit         _BIT_ACCESS(PRG2INS,2)
// PRG2INS<RG2INS3>
extern volatile __bit                   RG2INS3             __at(0x3CE3);	// @ (0x79C * 8 + 3)
#define                                 RG2INS3_bit         _BIT_ACCESS(PRG2INS,3)
// PRG2CON2<RG2ISET0>
extern volatile __bit                   RG2ISET0            __at(0x3CF8);	// @ (0x79F * 8 + 0)
#define                                 RG2ISET0_bit        _BIT_ACCESS(PRG2CON2,0)
// PRG2CON2<RG2ISET1>
extern volatile __bit                   RG2ISET1            __at(0x3CF9);	// @ (0x79F * 8 + 1)
#define                                 RG2ISET1_bit        _BIT_ACCESS(PRG2CON2,1)
// PRG2CON2<RG2ISET2>
extern volatile __bit                   RG2ISET2            __at(0x3CFA);	// @ (0x79F * 8 + 2)
#define                                 RG2ISET2_bit        _BIT_ACCESS(PRG2CON2,2)
// PRG2CON2<RG2ISET3>
extern volatile __bit                   RG2ISET3            __at(0x3CFB);	// @ (0x79F * 8 + 3)
#define                                 RG2ISET3_bit        _BIT_ACCESS(PRG2CON2,3)
// PRG2CON2<RG2ISET4>
extern volatile __bit                   RG2ISET4            __at(0x3CFC);	// @ (0x79F * 8 + 4)
#define                                 RG2ISET4_bit        _BIT_ACCESS(PRG2CON2,4)
// PRG2CON0<RG2MODE0>
extern volatile __bit                   RG2MODE0            __at(0x3CEA);	// @ (0x79D * 8 + 2)
#define                                 RG2MODE0_bit        _BIT_ACCESS(PRG2CON0,2)
// PRG2CON0<RG2MODE1>
extern volatile __bit                   RG2MODE1            __at(0x3CEB);	// @ (0x79D * 8 + 3)
#define                                 RG2MODE1_bit        _BIT_ACCESS(PRG2CON0,3)
// PRG2CON0<RG2OS>
extern volatile __bit                   RG2OS               __at(0x3CE9);	// @ (0x79D * 8 + 1)
#define                                 RG2OS_bit           _BIT_ACCESS(PRG2CON0,1)
// PRG2CON1<RG2RDY>
extern volatile __bit                   RG2RDY              __at(0x3CF2);	// @ (0x79E * 8 + 2)
#define                                 RG2RDY_bit          _BIT_ACCESS(PRG2CON1,2)
// PRG2CON0<RG2REDG>
extern volatile __bit                   RG2REDG             __at(0x3CEC);	// @ (0x79D * 8 + 4)
#define                                 RG2REDG_bit         _BIT_ACCESS(PRG2CON0,4)
// PRG2CON1<RG2RPOL>
extern volatile __bit                   RG2RPOL             __at(0x3CF0);	// @ (0x79E * 8 + 0)
#define                                 RG2RPOL_bit         _BIT_ACCESS(PRG2CON1,0)
// PRG2RTSS<RG2RTSS0>
extern volatile __bit                   RG2RTSS0            __at(0x3CD0);	// @ (0x79A * 8 + 0)
#define                                 RG2RTSS0_bit        _BIT_ACCESS(PRG2RTSS,0)
// PRG2RTSS<RG2RTSS1>
extern volatile __bit                   RG2RTSS1            __at(0x3CD1);	// @ (0x79A * 8 + 1)
#define                                 RG2RTSS1_bit        _BIT_ACCESS(PRG2RTSS,1)
// PRG2RTSS<RG2RTSS2>
extern volatile __bit                   RG2RTSS2            __at(0x3CD2);	// @ (0x79A * 8 + 2)
#define                                 RG2RTSS2_bit        _BIT_ACCESS(PRG2RTSS,2)
// PRG2RTSS<RG2RTSS3>
extern volatile __bit                   RG2RTSS3            __at(0x3CD3);	// @ (0x79A * 8 + 3)
#define                                 RG2RTSS3_bit        _BIT_ACCESS(PRG2RTSS,3)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x10EF);	// @ (0x21D * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// SSP1CON2<SEN>
extern volatile __bit                   SEN                 __at(0x10B0);	// @ (0x216 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSP1CON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONB<SLRB4>
extern volatile __bit                   SLRB4               __at(0x186C);	// @ (0x30D * 8 + 4)
#define                                 SLRB4_bit           _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRB5>
extern volatile __bit                   SLRB5               __at(0x186D);	// @ (0x30D * 8 + 5)
#define                                 SLRB5_bit           _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRB6>
extern volatile __bit                   SLRB6               __at(0x186E);	// @ (0x30D * 8 + 6)
